import { Main } from "../Main/Main"
import Navbar from "../Navigation/Navbar"

const About = () => {
  return (
    <div>

        <Navbar />
        <Main>
           <p style={{padding: "20vw"}}>ამ დავალებაში გვაქვს სამი გვერდი რომელიც შექმნილია "react-router-dom" საშუალებით. მაქვს გაკეთებული ცაალკე ფოლდერი სადაც აღწერილია ყველა გვერძე ნავიგაცია. თითოეული გვერდისთვის შექმნილია ცალკე ფოლდერი და მასშივეა განთავსებული ამ გვერდისთვის საჭირო სტილები. აგრეთვე მაქვს ორი "reusable" კომპონენტი. ერთი ნავიგაცია რომელსაც აქვს აგრეთვე ცალკე ფოლდერი თვისი გასტილვით. და მეორე "Main". ამ უკანასკნელს ვუყენებ ფონისთვის და ქონტენთის გასაცენტრად. მას გადავცემ ფროფსებს შვილების სახით. თითოეული გვერდის სტრუქტურე არის შემდეგნაირი: "NavBar" "Main" ქონთენთი "Main" </p>
        </Main>
    </div>
  )
}

export default About